# ELNet ablation base - YOLOv12n bỏ P5, thêm P2, thay A2C2f bằng DIMB_C3k2
nc: 80
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]     # P1/2
  - [-1, 1, Conv, [128, 3, 2]]    # P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]    # P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]    # P4/16
  - [-1, 2, DIMB_C3k2, [512, True]]  # thay A2C2f

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # ↑P3
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, DIMB_C3k2, [256, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # ↑P2
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 1, DIMB_C3k2, [128, False]]

  - [[-1, 9, 6], 1, Detect, [nc]]  # Detect(P2,P3,P4)
