# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO12 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo12
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo12n.yaml' will call yolo12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 272 layers, 2,602,288 parameters, 2,602,272 gradients, 6.7 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 272 layers, 9,284,096 parameters, 9,284,080 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 292 layers, 20,199,168 parameters, 20,199,152 gradients, 68.1 GFLOPs
  l: [1.00, 1.00, 512] # summary: 488 layers, 26,450,784 parameters, 26,450,768 gradients, 89.7 GFLOPs
  x: [1.00, 1.50, 512] # summary: 488 layers, 59,210,784 parameters, 59,210,768 gradients, 200.3 GFLOPs

# Backbone
backbone:
  - [-1, 1, SimpleStem, [3, 128]]
  - [-1, 3, VSSBlock, [128, 128]]
  - [-1, 1, VisionClueMerge, [128, 256]]   # 2 -> P3
  - [-1, 3, VSSBlock, [256, 256]]
  - [-1, 1, VisionClueMerge, [256, 512]]   # 4 -> P4
  - [-1, 9, VSSBlock, [512, 512]]
  - [-1, 1, VisionClueMerge, [512, 1024]]  # 6 -> P5
  - [-1, 3, VSSBlock, [1024, 1024]]
  - [-1, 1, SPPF, [1024, 1024]]              # 8

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]              # 10
  - [-1, 3, XSSBlock, [512, 512]]          # 11
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]              # 13
  - [-1, 3, XSSBlock, [256, 256]]          # 14
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [512, 512]]          # 17
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [1024, 1024]]        # 20
  - [[14, 17, 20], 1, Detect, [nc]]

