# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLOv12n + extra P2 head for small object detection

# Parameters
nc: 80  # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ---- BACKBONE ----
backbone:
  # [from, repeat, module, args]
  - [-1, 1, Conv, [64, 3, 2]]         # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1  P2/4  ← sẽ dùng làm P2 head input
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]        # 3  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]]        # 5  P4/16
  - [-1, 4, A2C2f, [512, True, 4]]    # 6
  - [-1, 1, Conv, [1024, 3, 2]]       # 7  P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]   # 8  ← P5 feature

# ---- HEAD ----
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]]                 # 10  cat P4
  - [-1, 2, A2C2f, [512, False, -1]]          # 11  P4-out

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 4], 1, Concat, [1]]                 # 13  cat P3
  - [-1, 2, A2C2f, [256, False, -1]]          # 14  P3-out

  # === ADDITIONAL FOR P2 ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 1], 1, Concat, [1]]                 # 16  cat P2 (layer 1 from backbone)
  - [-1, 1, C3k2, [64, False, 0.25]]         # 17  P2-out  ✅ thêm block mới
  # === END P2 ===

  # Downsample P3
  - [14, 1, Conv, [256, 3, 2]]                # 18
  - [[-1, 11], 1, Concat, [1]]               # 19
  - [-1, 2, A2C2f, [512, False, -1]]          # 20  P4-down-out

  # Downsample P4
  - [20, 1, Conv, [512, 3, 2]]                # 21
  - [[-1, 8], 1, Concat, [1]]                # 22
  - [-1, 2, C3k2, [1024, True]]              # 23  P5-out

  # DETECT
  - [[17, 14, 20, 23], 1, Detect, [nc]]       # 24  Detect(P2, P3, P4, P5)
