# =========================================================
# YOLOv12n-SSFF-CPAM ✅ Compatible with Ultralytics YOLOv12
# =========================================================
# Phiên bản đã bỏ P5, tích hợp SSFF + DFE + CPAM
# =========================================================

# Parameters
nc: 80 # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# =========================================================
# Backbone
# =========================================================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]            # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]           # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]    # 2-P2out
  - [-1, 1, Conv, [256, 3, 2]]           # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]    # 4-P3out
  - [-1, 1, Conv, [512, 3, 2]]           # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]       # 6-P4out (Output channels: 512)

# =========================================================
# Head
# =========================================================
head:
  # Branch P3 processing (leading to 128 channels for Detect)
  - [4, 1, Conv, [256, 1, 1]]            # 7: P3out (512ch) -> 256ch
  - [6, 1, Conv, [256, 1, 1]]            # 8: P4out (512ch) -> 256ch
  - [8, 1, nn.Upsample, [None, 2, "nearest"]] # 9: Upsample P4_256ch to P3 scale (256ch)
  - [[7, 9], 1, Concat, [1]]             # 10: Concat P3_256ch + Upsampled P4_256ch -> 512ch
  - [-1, 1, SSFF, [128]]                 # 11: SSFF output (128ch) at P3 scale. This is our P3 feature for CPAM.

  # Branch P4 processing (leading to 128 channels for Detect)
  - [4, 1, Conv, [256, 1, 1]]            # 12: P3out (512ch) -> 256ch
  - [6, 1, Conv, [256, 1, 1]]            # 13: P4out (512ch) -> 256ch
  - [12, 1, Conv, [256, 3, 2]]           # 14: Downsample P3_256ch to P4 scale (256ch)
  - [[13, 14], 1, Concat, [1]]           # 15: Concat P4_256ch + Downsampled P3_256ch -> 512ch
  - [-1, 1, DFE, [128]]                  # 16: DFE output (128ch) at P4 scale. This is our P4 feature for Detect.

  # CPAM integration
  # CPAM refines the P3 feature (Layer 11)
  - [11, 1, CPAM, [128]]                 # 17: CPAM refines the 128ch P3 feature. Output 128ch.

  # ---------- Detect ----------
  # Inputs to Detect:
  # P3-scale feature: 17 (CPAM output) -> 128 channels
  # P4-scale feature: 16 (DFE output) -> 128 channels
  # Both inputs are now 128 channels. This should finally match Detect's internal expectations.
  - [[17, 16], 1, Detect, [nc]]          # 18: Detect P3 (17) and P4 (16) outputs